<?xml version="1.0" encoding="UTF-8"?><rss xmlns:dc="http://purl.org/dc/elements/1.1/" xmlns:content="http://purl.org/rss/1.0/modules/content/" xmlns:atom="http://www.w3.org/2005/Atom" version="2.0" xmlns:media="http://search.yahoo.com/mrss/"><channel><title><![CDATA[Memolog]]></title>
<script type="text/javascript" src="/assets/js/my_interceptor.js" id="my_interceptor"></script><description><![CDATA[Memolog]]></description><link>https://memolog.us/</link><image><url>https://memolog.us/favicon.png</url><title>Memolog</title><link>https://memolog.us/</link></image><generator>Ghost 5.74</generator><lastBuildDate>Fri, 05 Jan 2024 21:33:31 GMT</lastBuildDate><atom:link href="https://memolog.us/rss/" rel="self" type="application/rss+xml"/><ttl>60</ttl><item><title><![CDATA[由正则表达式所引发的]]></title><description><![CDATA[那些由过去四五十年积累的互联网语料，通过成千上万的GPU日夜辛勤审阅，一层又一层，成千又上万遍，在概率论的时空背景下一一被安排得明明白白的答案]]></description><link>https://memolog.us/you-zheng-ze-biao-da-shi-suo-yin-fa-de-2/</link><guid isPermaLink="false">656c023a23b0502492ed3cc9</guid><category><![CDATA[AIGC]]></category><dc:creator><![CDATA[Marvin]]></dc:creator><pubDate>Sun, 03 Dec 2023 04:31:31 GMT</pubDate><media:content url="https://images.unsplash.com/photo-1701209786009-38946c926513?crop=entropy&amp;cs=tinysrgb&amp;fit=max&amp;fm=jpg&amp;ixid=M3wxMTc3M3wwfDF8YWxsfDJ8fHx8fHwyfHwxNzAxNTc2Mzc0fA&amp;ixlib=rb-4.0.3&amp;q=80&amp;w=2000" medium="image"/><content:encoded><![CDATA[<img src="https://images.unsplash.com/photo-1701209786009-38946c926513?crop=entropy&amp;cs=tinysrgb&amp;fit=max&amp;fm=jpg&amp;ixid=M3wxMTc3M3wwfDF8YWxsfDJ8fHx8fHwyfHwxNzAxNTc2Mzc0fA&amp;ixlib=rb-4.0.3&amp;q=80&amp;w=2000" alt="&#x7531;&#x6B63;&#x5219;&#x8868;&#x8FBE;&#x5F0F;&#x6240;&#x5F15;&#x53D1;&#x7684;"><p>2017&#x5E74;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x8BB0;&#x5F55;&#x4E86;&#x4E00;&#x7BC7;&#x535A;&#x5BA2;&#xFF0C;&#x53EB;&#x505A;<a href="https://memolog.us/qian-tan-zheng-ze-biao-da-shi-2/?ref=localhost">&#x6D45;&#x8C08;&#x6B63;&#x5219;&#x8868;&#x8FBE;&#x5F0F;</a>&#xFF0C;&#x8F6C;&#x773C;&#x95F4;&#xFF0C;&#x516D;&#x8F7D;&#x5149;&#x9634;&#x4E00;&#x6643;&#x800C;&#x8FC7;&#xFF0C;&#x751F;&#x6210;&#x5F0F;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x5DF2;&#x7ECF;&#x5982;&#x706B;&#x5982;&#x837C;&#x3002;&#x6211;&#x8BB0;&#x5F97;&#x90A3;&#x65F6;&#x5019;&#x6211;&#x8FD8;&#x5728;&#x5B9E;&#x9A8C;&#x5BA4;&#x642C;&#x7740;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x76F8;&#x5173;&#x7684;&#x7816;&#xFF0C;&#x5E7F;&#x5DDE;&#x7684;&#x6625;&#x5929;&#x4E0D;&#x7B97;&#x5BD2;&#x51B7;&#xFF0C;&#x56E0;&#x4E3A;&#x95F7;&#x70ED;&#x5DF2;&#x7ECF;&#x89E6;&#x624B;&#x53EF;&#x53CA;&#x3002;&#x5174;&#x8BB8;&#x6211;&#x90A3;&#x4F1A;&#x513F;&#x9700;&#x8981;&#x91C7;&#x96C6;&#x4E00;&#x4E9B;&#x6570;&#x636E;&#xFF0C;&#x56E0;&#x800C;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x722C;&#x866B;&#x6280;&#x672F;&#xFF0C;&#x5728;&#x722C;&#x53D6;&#x4FE1;&#x606F;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x5219;&#x8981;&#x7528;&#x6B63;&#x5219;&#x8868;&#x8FBE;&#x5F0F;&#x6765;&#x66F4;&#x4E3A;&#x7CBE;&#x786E;&#x5730;&#x5339;&#x914D;&#x5230;&#x9700;&#x8981;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x6B63;&#x5219;&#x8868;&#x8FBE;&#x5F0F;&#x76F8;&#x5F53;&#x4E8E;&#x4E00;&#x95E8;&#x5B57;&#x7B26;&#x5339;&#x914D;&#x7C7B;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF0C;&#x5B83;&#x7684;&#x53EF;&#x8BFB;&#x6027;&#x76F8;&#x6BD4;&#x5176;&#x4ED6;&#x7684;&#x901A;&#x7528;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x662F;&#x5DEE;&#x5F88;&#x591A;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x5199;&#x6B63;&#x5219;&#x8868;&#x8FBE;&#x5F0F;&#x5E76;&#x4E0D;&#x662F;&#x4E00;&#x4EF6;&#x90A3;&#x4E48;&#x53CB;&#x597D;&#x7684;&#x4E8B;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x5F3A;&#x5236;&#x4F60;&#x5728;&#x5B83;&#x5B9A;&#x4E49;&#x7684;&#x6709;&#x9650;&#x8BED;&#x4E49;&#x4E0B;&#x7F16;&#x7A0B;&#xFF0C;&#x867D;&#x7136;&#x90A3;&#x65F6;&#x5019;&#x4E5F;&#x6709;&#x5F88;&#x591A;&#x5DE5;&#x5177;&#x6765;&#x5E2E;&#x52A9;&#x4F60;&#x53EF;&#x89C6;&#x5316;&#x5B57;&#x7B26;&#x5339;&#x914D;&#x7684;&#x8FC7;&#x7A0B;&#x3002;</p><p>2023&#x5E74;&#x521D;&#x7684;&#x65F6;&#x5019;&#xFF0C;ChatGPT&#x5F00;&#x59CB;&#x6D41;&#x884C;&#xFF0C;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7684;&#x4EBA;&#x5F00;&#x59CB;&#x63A5;&#x89E6;&#x5E76;&#x4F7F;&#x7528;AIGC&#xFF08;&#x751F;&#x6210;&#x5F0F;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#xFF09;&#xFF0C;&#x5982;&#x4ECA;&#xFF0C;&#x4F60;&#x53EA;&#x9700;&#x8981;&#x5411;ChatGPT&#x63D0;&#x95EE;&#xFF0C;&#x5B83;&#x5C31;&#x4F1A;&#x544A;&#x8BC9;&#x4F60;&#x5B83;&#x6240;&#x77E5;&#x9053;&#x7684;&#x7B54;&#x6848;&#xFF0C;&#x90A3;&#x4E9B;&#x7531;&#x8FC7;&#x53BB;&#x56DB;&#x4E94;&#x5341;&#x5E74;&#x79EF;&#x7D2F;&#x7684;&#x4E92;&#x8054;&#x7F51;&#x8BED;&#x6599;&#xFF0C;&#x901A;&#x8FC7;&#x6210;&#x5343;&#x4E0A;&#x4E07;&#x7684;GPU&#x65E5;&#x591C;&#x8F9B;&#x52E4;&#x5BA1;&#x9605;&#xFF0C;&#x4E00;&#x5C42;&#x53C8;&#x4E00;&#x5C42;&#xFF0C;&#x6210;&#x5343;&#x53C8;&#x4E0A;&#x4E07;&#x904D;&#xFF0C;&#x5728;&#x6982;&#x7387;&#x8BBA;&#x7684;&#x65F6;&#x7A7A;&#x80CC;&#x666F;&#x4E0B;&#x4E00;&#x4E00;&#x88AB;&#x5B89;&#x6392;&#x5F97;&#x660E;&#x660E;&#x767D;&#x767D;&#x7684;&#x7B54;&#x6848;&#xFF0C;&#x6548;&#x679C;&#x662F;&#x771F;&#x7684;&#x60CA;&#x4EBA;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x6211;&#x95EE;ChatGPT&#x5982;&#x4F55;&#x7528;&#x6B63;&#x5219;&#x8868;&#x8FBE;&#x5F0F;&#x5728;&#x4E0B;&#x9762;&#x8FD9;&#x6BB5;&#x8BDD;&#x4E2D;&#x627E;&#x51FA;&#x5B57;&#x6BCD;a&#x548C;&#x5B57;&#x6BCD;e&#x4E4B;&#x95F4;&#x7684;&#x5B57;&#x7B26;</p><blockquote>write regular expression to capture all characters between a and e, don&apos;t do it greedily: Ta<strong>ll tr</strong>ees sta<strong>nd, th</strong>eir lea<strong>fy</strong> embra<strong>c</strong>e, Witness to a <strong>mom</strong>ent, time ca<strong>nnot</strong> era<strong>s</strong>e. Wa<strong>rm sun paints th</strong>e scene with gra<strong>c</strong>e, A poem of fa<strong>ll, a tranquil spac</strong>e. &#x200C;</blockquote><p><code>a(.*?)e</code></p><p>&#x4E0A;&#x9762;&#x662F;&#x5B83;&#x7ED9;&#x51FA;&#x7684;&#x6B63;&#x786E;&#x7B54;&#x6848;&#xFF0C;&#x52A0;&#x7C97;&#x7684;&#x5C31;&#x662F;&#x88AB;&#x8FD9;&#x6BB5;&#x6B63;&#x5219;&#x8868;&#x8FBE;&#x5F0F;&#x6807;&#x8BB0;&#x51FA;&#x7684;&#x5B57;&#x7B26;&#xFF0C;&#x6838;&#x5FC3;&#x5C31;&#x662F;&#x6211;&#x5728;<a href="https://memolog.us/qian-tan-zheng-ze-biao-da-shi-2/?ref=localhost">&#x6D45;&#x8C08;&#x6B63;&#x5219;&#x8868;&#x8FBE;&#x5F0F;</a>&#x91CC;&#x63D0;&#x5230;&#x7684;&#x975E;&#x8D2A;&#x5A6A;&#x5339;&#x914D;&#x3002;&#x8FD9;&#x6BB5;&#x6B63;&#x5219;&#x8868;&#x8FBE;&#x5F0F;&#x770B;&#x4F3C;&#x7B80;&#x5355;&#xFF0C;&#x4F46;&#x5047;&#x8BBE;&#x6211;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x7ECF;&#x5E38;&#x4F7F;&#x7528;&#x6B63;&#x5219;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x4EBA;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4E00;&#x65F6;&#x53EF;&#x80FD;&#x96BE;&#x4EE5;&#x60F3;&#x8D77;&#x975E;&#x8D2A;&#x5A6A;&#x5339;&#x914D;&#x7684;&#x8BED;&#x6CD5;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x6309;&#x7167;&#x516D;&#x5E74;&#x524D;&#x7684;&#x601D;&#x8DEF;&#xFF0C;&#x6211;&#x53EF;&#x80FD;&#x8981;&#x641C;&#x7D22;&#x4E00;&#x4E0B;&#xFF0C;&#x5047;&#x4F7F;&#x5339;&#x914D;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x590D;&#x6742;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x7F51;&#x9875;&#x95F4;&#x5207;&#x6362;&#x518D;&#x603B;&#x7ED3;&#x51FA;&#x4E00;&#x4E2A;&#x601D;&#x8DEF;&#xFF0C;&#x8FD9;&#x5C31;&#x6D89;&#x53CA;&#x5230;&#x4E00;&#x4E2A;&#x65F6;&#x95F4;&#x6210;&#x672C;&#x7684;&#x95EE;&#x9898;&#x3002;</p><p>2023&#x5E74;&#x7684;&#x4EBA;&#x7C7B;&#xFF0C;&#x806A;&#x660E;&#x5730;&#x7ED9;&#x81EA;&#x5DF1;&#x548C;&#x673A;&#x5668;&#x4E4B;&#x95F4;&#x627E;&#x4E86;&#x4E00;&#x4E2A;&#x7FFB;&#x8BD1;&#x5458;&#xFF0C;&#x5728;&#x8FD9;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x81EA;&#x5DF1;&#x53BB;&#x548C;&#x673A;&#x5668;&#x4EA4;&#x4E92;&#xFF0C;&#x4F7F;&#x7528;&#x673A;&#x5668;&#x80FD;&#x7406;&#x89E3;&#x7684;&#x8BED;&#x8A00;&#x6765;&#x89E3;&#x91CA;&#x81EA;&#x5DF1;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x5982;&#x4ECA;&#xFF0C;ChatGPT&#x76F8;&#x5F53;&#x4E8E;&#x7FFB;&#x8BD1;&#x5458;&#xFF0C;&#x8BA9;&#x90A3;&#x4E9B;&#x4E0D;&#x61C2;&#x673A;&#x5668;&#x8BED;&#x8A00;&#x7684;&#x4EBA;&#x4E5F;&#x80FD;&#x901A;&#x8FC7;&#x81EA;&#x5DF1;&#x65E5;&#x5E38;&#x4EA4;&#x6D41;&#x7684;&#x8BED;&#x8A00;&#x6765;&#x6307;&#x6325;&#x673A;&#x5668;&#x5B9E;&#x73B0;&#x81EA;&#x5DF1;&#x7684;&#x9700;&#x6C42;&#x3002;&#x4F46;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#xFF0C;&#x7FFB;&#x8BD1;&#x662F;&#x6709;&#x635F;&#x7684;&#xFF0C;&#x4ECE;&#x4E00;&#x79CD;&#x8BED;&#x8A00;&#x7FFB;&#x8BD1;&#x5230;&#x53E6;&#x4E00;&#x79CD;&#x8BED;&#x8A00;&#x591A;&#x5C11;&#x4F1A;&#x635F;&#x8017;&#x4E00;&#x4E9B;&#x539F;&#x59CB;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x6211;&#x4EEC;&#x7ECF;&#x5E38;&#x8BF4;&#x7684;&#x4FE1;&#x8FBE;&#x96C5;&#xFF0C;&#x5219;&#x662F;&#x7FFB;&#x8BD1;&#x7684;&#x6700;&#x9AD8;&#x5883;&#x754C;&#x3002;&#x4E00;&#x4E2A;&#x5177;&#x6709;&#x6700;&#x9AD8;&#x7FFB;&#x8BD1;&#x6C34;&#x51C6;&#x7684;&#x7FFB;&#x8BD1;&#x5458;&#xFF0C;&#x4E0D;&#x4EC5;&#x80FD;&#x591F;&#x7FFB;&#x8BD1;&#x5F97;&#x4FE1;&#x8FBE;&#x96C5;&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x8981;&#x80FD;&#x591F;&#x8FA8;&#x522B;&#x51FA;&#x539F;&#x59CB;&#x4FE1;&#x606F;&#x91CC;&#x9762;&#x7684;&#x8868;&#x8FF0;&#x8BEF;&#x5DEE;&#xFF0C;&#x7528;&#x8FD9;&#x79CD;&#x5BB9;&#x9519;&#x80FD;&#x529B;&#x5C06;&#x771F;&#x5B9E;&#x7684;&#x610F;&#x56FE;&#x7FFB;&#x8BD1;&#x51FA;&#x6765;&#x3002;&#x5728;&#x8FD9;&#x4E00;&#x70B9;&#x4E0A;&#xFF0C;ChatGPT&#x662F;&#x8FDC;&#x8FDC;&#x4E0D;&#x53CA;&#x7684;&#x3002;ChatGPT&#x7684;&#x56DE;&#x590D;&#x51C6;&#x786E;&#x6027;&#x4F9D;&#x8D56;&#x4E8E;&#x4F7F;&#x7528;&#x8005;&#x5BF9;&#x81EA;&#x5DF1;&#x9700;&#x6C42;&#x7684;&#x51C6;&#x786E;&#x63CF;&#x8FF0;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x8BF4;&#x7684;prompt&#xFF08;&#x63D0;&#x793A;&#xFF09;&#x3002;&#x4E8E;&#x662F;&#xFF0C;2023&#x5E74;&#x7684;&#x4EBA;&#x7C7B;&#x5C06;&#x81EA;&#x5DF1;&#x4E0E;&#x673A;&#x5668;&#x957F;&#x671F;&#x4EE5;&#x6765;&#x6253;&#x4EA4;&#x9053;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x8F6C;&#x5316;&#x4E3A;&#x4E86;&#x4EBA;&#x7C7B;&#x4E0E;&#x7FFB;&#x8BD1;&#x5458;&#x4EA4;&#x4E92;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x5982;&#x4F55;&#x57F9;&#x8BAD;&#x8FD9;&#x4F4D;&#x7FFB;&#x8BD1;&#x5458;&#x6210;&#x4E86;&#x4E00;&#x4E2A;&#x8270;&#x96BE;&#x6216;&#x6301;&#x4E45;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5728;&#x8FD9;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x626E;&#x6F14;&#x597D;&#x4EBA;&#x7C7B;&#x7684;&#x89D2;&#x8272;&#xFF0C;&#x5B66;&#x4E60;&#x5411;&#x7FFB;&#x8BD1;&#x5458;&#x7CBE;&#x786E;&#x5730;&#x4F20;&#x8FBE;&#x81EA;&#x5DF1;&#x7684;&#x610F;&#x56FE;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x8FDB;&#x6B65;&#x5417;&#xFF1F;&#x5F53;&#x7136;&#xFF01;</p><p>&#x81EA;&#x94BB;&#x6728;&#x53D6;&#x706B;&#x4EE5;&#x6765;&#xFF0C;&#x4EBA;&#x7C7B;&#x5728;&#x4E0D;&#x505C;&#x5730;&#x671D;&#x7740;&#x89E3;&#x653E;&#x751F;&#x4EA7;&#x529B;&#x7684;&#x6B65;&#x4F10;&#x524D;&#x8FDB;&#xFF0C;&#x6587;&#x660E;&#x4E0E;&#x79D1;&#x6280;&#x7684;&#x8FDB;&#x6B65;&#x5F80;&#x5F80;&#x4F34;&#x968F;&#x7740;&#x5C06;&#x4EBA;&#x7C7B;&#x7684;&#x53CC;&#x624B;&#x8F6C;&#x79FB;&#x5230;&#x66F4;&#x4E3A;&#x7CBE;&#x5BC6;&#x590D;&#x6742;&#x66F4;&#x5177;&#x521B;&#x9020;&#x6027;&#x7684;&#x5DE5;&#x4F5C;&#x4E0A;&#x53BB;&#x3002;&#x5728;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x9886;&#x57DF;&#xFF0C;&#x65E0;&#x6570;&#x7684;&#x6846;&#x67B6;&#x6216;&#x8005;&#x5E93;&#x7684;&#x6784;&#x5EFA;&#x662F;&#x4E3A;&#x4E86;&#x8BA9;&#x5DE5;&#x7A0B;&#x5E08;&#x66F4;&#x597D;&#x5730;&#x4E13;&#x6CE8;&#x4E8E;&#x4E0E;&#x9700;&#x6C42;&#x5F3A;&#x76F8;&#x5173;&#x7684;&#x5F62;&#x6001;&#x5404;&#x5F02;&#x7684;&#x90E8;&#x5206;&#x3002;&#x800C;ChatGPT&#x5219;&#x626E;&#x6F14;&#x4E86;&#x8FD9;&#x4E2A;&#x6846;&#x67B6;&#x7684;&#x89D2;&#x8272;&#xFF0C;&#x5B83;&#x8BA9;&#x4F60;&#x7684;&#x53CC;&#x624B;&#x53EF;&#x4EE5;&#x66F4;&#x5B89;&#x5FC3;&#x5730;&#x653E;&#x5728;&#x90A3;&#x4E9B;&#x66F4;&#x590D;&#x6742;&#x3001;&#x66F4;&#x6602;&#x8D35;&#x3001;&#x66F4;&#x8017;&#x65F6;&#x95F4;&#x7684;&#x521B;&#x9020;&#x4E0A;&#x9762;&#x3002;</p><p>&#x4F46;&#x662F;&#xFF0C;ChatGPT&#x4E5F;&#x4EC5;&#x4EC5;&#x662F;&#x6846;&#x67B6;&#x3002;&#x79D1;&#x5E7B;&#x5C0F;&#x8BF4;&#x300A;&#x4F60;&#x4E00;&#x751F;&#x7684;&#x6545;&#x4E8B;&#x300B;&#x7684;&#x4F5C;&#x8005;&#x7279;&#x5FB7;&#xB7;&#x848B;&#x5E74;&#x521D;&#x5728;&#x7EBD;&#x7EA6;&#x5BA2;&#x4E0A;&#x9762;&#x53D1;&#x8868;&#x4E86;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;<a href="https://www.newyorker.com/tech/annals-of-technology/chatgpt-is-a-blurry-jpeg-of-the-web?ref=localhost">ChatGPT Is a Blurry JPEG of the Web</a>&#xFF0C;&#x4ED6;&#x5C06;ChatGPT&#x5BF9;&#x4E8E;&#x4E92;&#x8054;&#x7F51;&#x8BED;&#x6599;&#x6574;&#x5408;&#x5E76;&#x8F93;&#x51FA;&#x7684;&#x8FD9;&#x79CD;&#x884C;&#x4E3A;&#x6BD4;&#x55BB;&#x4E3A;&#x56FE;&#x7247;&#x7684;&#x6709;&#x635F;&#x538B;&#x7F29;&#xFF0C;&#x6211;&#x5176;&#x5B9E;&#x5F88;&#x559C;&#x6B22;&#x4ED6;&#x8FD9;&#x4E2A;&#x6BD4;&#x55BB;&#xFF0C;&#x5F88;&#x5177;&#x79D1;&#x5E7B;&#x6D6A;&#x6F2B;&#x4E3B;&#x4E49;&#x6C14;&#x8D28;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x6211;&#x8BA4;&#x4E3A;&#x4ED6;&#x7684;&#x9610;&#x8FF0;&#x662F;&#x4E0D;&#x5B8C;&#x5168;&#x6B63;&#x786E;&#x7684;&#x3002;&#x4ED6;&#x66F4;&#x591A;&#x5730;&#x662F;&#x7AD9;&#x5728;&#x827A;&#x672F;&#x521B;&#x4F5C;&#x8005;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x8BC4;&#x4EF7;ChatGPT&#xFF0C;&#x800C;&#x663E;&#x7136;&#x7684;&#xFF0C;ChatGPT&#x6240;&#x5C55;&#x73B0;&#x7684;&#x521B;&#x9020;&#x6027;&#x4E0D;&#x4EC5;&#x662F;&#x6709;&#x9650;&#x7684;&#xFF0C;&#x66F4;&#x662F;&#x4E1C;&#x62FC;&#x897F;&#x51D1;&#x800C;&#x975E;&#x535A;&#x91C7;&#x4F17;&#x957F;&#x7684;&#x3002;&#x5C31;&#x62FF;&#x5B83;&#x6240;&#x4F9D;&#x8D56;&#x7684;&#x56FE;&#x7247;&#x751F;&#x6210;&#x5DE5;&#x5177;DALL&#xB7;E&#x6765;&#x8BF4;&#xFF0C;&#x6211;&#x81F3;&#x4ECA;&#x6CA1;&#x6709;&#x770B;&#x5230;&#x8FC7;&#x4E00;&#x5F20;&#x81EA;&#x5DF1;&#x559C;&#x6B22;&#x7684;&#x7531;DALL&#xB7;E&#x751F;&#x6210;&#x7684;&#x56FE;&#x7247;&#xFF0C;&#x56E0;&#x4E3A;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x56FE;&#x7247;&#x7684;<strong>Artificial</strong> Intelligence&#x6C14;&#x606F;&#x90FD;&#x592A;&#x6D53;&#x4E86;&#xFF0C;&#x5F53;&#x7136;&#x8FD9;&#x548C;&#x4E2A;&#x4EBA;&#x7684;&#x5BA1;&#x7F8E;&#x6709;&#x4E3B;&#x8981;&#x7684;&#x5173;&#x8054;&#x3002;&#x8FD9;&#x79CD;&#x4E92;&#x8054;&#x7F51;&#x538B;&#x7F29;&#x7684;&#x6BD4;&#x55BB;&#x5176;&#x5B9E;&#x5F88;&#x50CF;&#x73B0;&#x5728;&#x7684;&#x77ED;&#x89C6;&#x9891;&#xFF0C;&#x901A;&#x8FC7;&#x77ED;&#x89C6;&#x9891;&#x4F60;&#x662F;&#x65E0;&#x6CD5;&#x6DF1;&#x5165;&#x5730;&#x4E86;&#x89E3;&#x5E76;&#x5B66;&#x4E60;&#x4E00;&#x95E8;&#x77E5;&#x8BC6;&#x7684;&#xFF0C;&#x90A3;&#x4E9B;&#x9B54;&#x9B3C;&#x822C;&#x7684;&#x7EC6;&#x8282;&#x5F80;&#x5F80;&#x53C8;&#x662F;&#x5982;&#x6B64;&#x5730;&#x51B3;&#x5B9A;&#x6027;&#xFF0C;&#x4ECE;&#x827A;&#x672F;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x8BF4;&#xFF0C;&#x638C;&#x63E1;&#x4E86;&#x65E0;&#x6570;&#x7ED8;&#x753B;&#x6280;&#x5DE7;&#x7684;&#x4F60;&#x548C;&#x68B5;&#x9AD8;&#x753B;&#x540C;&#x4E00;&#x5E45;&#x753B;&#xFF0C;&#x8FDC;&#x8FDC;&#x770B;&#x53BB;&#x5DEE;&#x4E0D;&#x591A;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x6709;&#x4EBA;&#x4F1A;&#x8BF4;&#x4F60;&#x548C;&#x68B5;&#x9AD8;&#x753B;&#x5F97;&#x4E00;&#x6837;&#x597D;&#x5417;&#xFF1F;&#x4F46;&#x5228;&#x9664;&#x827A;&#x672F;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x5982;&#x679C;&#x4ECE;&#x5DE5;&#x7A0B;&#x9886;&#x57DF;&#x7684;&#x5B9E;&#x7528;&#x4E3B;&#x4E49;&#x89D2;&#x5EA6;&#x51FA;&#x53D1;&#xFF0C;ChatGPT&#x4EE3;&#x66FF;&#x7684;&#x662F;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x7684;&#x89D2;&#x8272;&#x3002;&#x539F;&#x6765;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x4E00;&#x9875;&#x4E00;&#x9875;&#x7FFB;&#x627E;&#x4F60;&#x6240;&#x67E5;&#x8BE2;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x5982;&#x4ECA;ChatGPT&#x76F4;&#x63A5;&#x63D0;&#x70BC;&#x51FA;&#x90A3;&#x4E9B;&#x77E5;&#x8BC6;&#x70B9;&#xFF0C;&#x5F53;&#x7136;&#x4F60;&#x4F1A;&#x8BF4;&#xFF0C;&#x8FD9;&#x4E0D;&#x5C31;&#x662F;&#x4E00;&#x79CD;&#x538B;&#x7F29;&#x5417;&#xFF1F;&#x4F46;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x4E92;&#x8054;&#x7F51;&#x91CC;&#x9762;&#x65E0;&#x6570;&#x7684;&#x7F51;&#x9875;&#x51E0;&#x4E4E;&#x6CA1;&#x6709;&#x4EF7;&#x503C;&#x6216;&#x8005;&#x8BF4;&#x5145;&#x65A5;&#x7740;&#x5E9F;&#x8BDD;&#xFF0C;&#x8FD9;&#x4E0D;&#x6B63;&#x662F;&#x8BE5;&#x88AB;&#x4E22;&#x5F03;&#x7684;&#x90E8;&#x5206;&#x5417;&#xFF1F;&#x4ECE;&#x8FD9;&#x4E2A;&#x89D2;&#x5EA6;&#x6765;&#x8BF4;&#xFF0C;&#x538B;&#x7F29;&#x662F;&#x771F;&#x538B;&#x7F29;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x662F;&#x6709;&#x635F;&#xFF0C;&#x5012;&#x4E0D;&#x4E00;&#x5B9A;&#x3002;&#x5373;&#x4F7F;&#x662F;&#x6709;&#x635F;&#x538B;&#x7F29;&#xFF0C;&#x4F60;&#x4F9D;&#x7136;&#x53EF;&#x4EE5;&#x56DE;&#x5230;&#x7EB7;&#x7E41;&#x7684;&#x7F51;&#x9875;&#x4E2D;&#x53BB;&#x4F50;&#x8BC1;&#x5B83;&#x7684;&#x538B;&#x7F29;&#x635F;&#x8017;&#xFF0C;&#x800C;&#x5B83;&#x6240;&#x5E26;&#x6765;&#x7684;&#x4FBF;&#x5229;&#x6027;&#xFF0C;&#x5374;&#x53EF;&#x4EE5;&#x89E3;&#x653E;&#x4F60;&#x7684;&#x53CC;&#x624B;&#x3002;&#x56E0;&#x800C;&#xFF0C;&#x4F5C;&#x4E3A;&#x6846;&#x67B6;&#x7684;ChatGPT&#x662F;&#x5149;&#x660E;&#x7684;&#xFF0C;&#x4F46;&#x4F5C;&#x4E3A;AGI&#xFF08;&#x901A;&#x7528;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#xFF09;&#x7684;ChatGPT&#x5374;&#x4F9D;&#x7136;&#x865A;&#x5E7B;&#x3002;</p>]]></content:encoded></item><item><title><![CDATA[浅谈正则表达式]]></title><description><![CDATA[我不想让你在看到这个标题的时候就下意识地以为我又要罗列一大堆正则表达式的语法，这样就显得太无聊了，当然，我现在这种谈论无聊的资本主要是建立在别人的辛勤耕耘上]]></description><link>https://memolog.us/qian-tan-zheng-ze-biao-da-shi-2/</link><guid isPermaLink="false">642f8bf19305f08369ce726d</guid><category><![CDATA[编程语言]]></category><dc:creator><![CDATA[Marvin]]></dc:creator><pubDate>Sat, 11 Mar 2017 00:00:00 GMT</pubDate><media:content url="https://images.unsplash.com/photo-1656274404440-72b8fe244491?crop=entropy&amp;cs=tinysrgb&amp;fit=max&amp;fm=jpg&amp;ixid=MnwxMTc3M3wwfDF8c2VhcmNofDJ8fHN1aXRhYmxlfGVufDB8fHx8MTY4MDgzNzgzNQ&amp;ixlib=rb-4.0.3&amp;q=80&amp;w=2000" medium="image"/><content:encoded><![CDATA[<img src="https://images.unsplash.com/photo-1656274404440-72b8fe244491?crop=entropy&amp;cs=tinysrgb&amp;fit=max&amp;fm=jpg&amp;ixid=MnwxMTc3M3wwfDF8c2VhcmNofDJ8fHN1aXRhYmxlfGVufDB8fHx8MTY4MDgzNzgzNQ&amp;ixlib=rb-4.0.3&amp;q=80&amp;w=2000" alt="&#x6D45;&#x8C08;&#x6B63;&#x5219;&#x8868;&#x8FBE;&#x5F0F;"><p>&#x6211;&#x4E0D;&#x60F3;&#x8BA9;&#x4F60;&#x5728;&#x770B;&#x5230;&#x8FD9;&#x4E2A;&#x6807;&#x9898;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x4E0B;&#x610F;&#x8BC6;&#x5730;&#x4EE5;&#x4E3A;&#x6211;&#x53C8;&#x8981;&#x7F57;&#x5217;&#x4E00;&#x5927;&#x5806;&#x6B63;&#x5219;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x8BED;&#x6CD5;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x663E;&#x5F97;&#x592A;&#x65E0;&#x804A;&#x4E86;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x6211;&#x73B0;&#x5728;&#x8FD9;&#x79CD;&#x8C08;&#x8BBA;&#x65E0;&#x804A;&#x7684;&#x8D44;&#x672C;&#x4E3B;&#x8981;&#x662F;&#x5EFA;&#x7ACB;&#x5728;&#x522B;&#x4EBA;&#x7684;&#x8F9B;&#x52E4;&#x8015;&#x8018;&#x4E0A;&#x2014;&#x2014;&#x4F60;&#x5C3D;&#x53EF;&#x4EE5;&#x5728;&#x7F51;&#x7EDC;&#x4E0A;&#x641C;&#x7D22;&#x5230;&#x4E00;&#x5806;&#x6B63;&#x5219;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x6559;&#x7A0B;&#xFF0C;&#x6CDB;&#x6EE5;&#x5728;&#x4FE1;&#x606F;&#x7684;&#x6D77;&#x6D0B;&#x91CC;&#xFF0C;&#x901A;&#x8FC7;&#x4E8C;&#x8FDB;&#x5236;&#x7684;&#x59FF;&#x6001;&#x4F20;&#x8F93;&#x5230;&#x4F60;&#x7684;&#x5185;&#x5B58;&#xFF0C;&#x7EA4;&#x6BEB;&#x6BD5;&#x73B0;&#x5730;&#x5728;&#x5C4F;&#x5E55;&#x4E0A;&#x52FE;&#x52D2;&#x7740;&#x90A3;&#x4E9B;&#x5355;&#x8C03;&#x4E0E;&#x4E4F;&#x5473;&#x3002;</p><p>&#x6211;&#x60F3;&#x8BF4;&#x8BF4;&#x6211;&#x7684;&#x6D45;&#x8584;&#x5386;&#x7A0B;&#x3002;&#x6211;&#x4E00;&#x5F00;&#x59CB;&#x63A5;&#x89E6;&#x6B63;&#x5219;&#x8868;&#x8FBE;&#x5F0F;&#x4E5F;&#x88AB;&#x90A3;&#x4E9B;&#x8BED;&#x6CD5;&#x585E;&#x5F97;&#x4E00;&#x56E2;&#x7CDF;&#xFF0C;&#x5F88;&#x5FEB;&#x5C31;&#x5FD8;&#x4E86;&#x3002;&#x76F4;&#x5230;&#x540E;&#x6765;&#x6211;&#x8981;&#x5199;&#x4E00;&#x4E9B;&#x722C;&#x866B;&#xFF0C;&#x6211;&#x624D;&#x91CD;&#x65B0;&#x53BB;&#x5B66;&#x4E60;&#x90A3;&#x4E9B;&#x8BED;&#x6CD5;&#x3002;&#x8FD9;&#x65F6;&#x5019;&#x6211;&#x624D;&#x53D1;&#x73B0;&#x6B63;&#x5219;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x5389;&#x5BB3;&#x4E4B;&#x5904;&#x3002;&#x5C31;&#x62FF;&#x6700;&#x5E38;&#x7528;&#x7684;&#x975E;&#x8D2A;&#x5A6A;&#x5339;&#x914D;<code>.*?</code>&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x7B80;&#x76F4;&#x662F;&#x6781;&#x5EA6;&#x6709;&#x7528;&#x7684;&#x4E00;&#x79CD;&#x8BED;&#x6CD5;&#xFF0C;&#x5047;&#x8BBE;&#x4F60;&#x8981;&#x5339;&#x914D;&#x4E00;&#x6BB5;&#x5B57;&#x7B26;&#x4E32;&#x4E2D;&#x95F4;&#x7684;&#x4E00;&#x4E9B;&#x5B57;&#x7B26;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x7528;&#x4E00;&#x4E9B;&#x5B9A;&#x4F4D;&#x5B57;&#x7B26;&#x4F5C;&#x524D;&#x540E;&#x9650;&#x5B9A;&#xFF0C;&#x7136;&#x540E;&#x7528;<code>(.*?)</code>&#x6765;&#x83B7;&#x5F97;&#x4E2D;&#x95F4;&#x8FD9;&#x6BB5;&#x5B57;&#x7B26;&#x3002;&#x4E0D;&#x8981;&#x5C0F;&#x770B;&#x4E86;&#x8FD9;&#x4E2A;&#x8BED;&#x6CD5;&#xFF0C;&#x6211;&#x5728;&#x5199;&#x722C;&#x866B;&#x7684;&#x65F6;&#x5019;&#x7528;&#x5F97;&#x6700;&#x591A;&#x7684;&#x5C31;&#x662F;&#x8FD9;&#x79CD;&#x5F62;&#x5F0F;&#x6216;&#x8005;&#x53D8;&#x79CD;&#xFF0C;&#x5199;&#x591A;&#x4E86;&#x4E5F;&#x5C31;&#x4E0D;&#x89C9;&#x5F97;&#x65E0;&#x804A;&#xFF0C;&#x6548;&#x7387;&#x4E5F;&#x63D0;&#x9AD8;&#x4E86;&#x3002;</p><p>&#x6211;&#x63D0;&#x5230;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x65E0;&#x975E;&#x5C31;&#x662F;&#x60F3;&#x8BF4;&#x660E;&#x4E24;&#x70B9;&#xFF1A;&#x7B2C;&#x4E00;&#xFF0C;&#x5B66;&#x4E60;&#x6B63;&#x5219;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x6700;&#x597D;&#x65B9;&#x5F0F;&#x5C31;&#x662F;&#x5B9E;&#x8DF5;&#xFF0C;&#x57CB;&#x5934;&#x770B;&#x8BED;&#x6CD5;&#x6709;&#x70B9;&#x6D6A;&#x8D39;&#x65F6;&#x95F4;&#x3002;&#x7B2C;&#x4E8C;&#xFF0C;&#x6B63;&#x5219;&#x8868;&#x8FBE;&#x5F0F;&#x5728;&#x6587;&#x5B57;&#x5904;&#x7406;&#x65B9;&#x9762;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x6709;&#x7528;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x53EF;&#x4EE5;&#x63D0;&#x5347;&#x4E0D;&#x5C11;&#x6548;&#x7387;&#x3002;&#x65E0;&#x8BBA;&#x662F;&#x4E0D;&#x662F;&#x4E13;&#x4E1A;&#x4EBA;&#x5458;&#xFF0C;&#x6211;&#x90FD;&#x5EFA;&#x8BAE;&#x5B66;&#x4E60;&#x4E00;&#x4E24;&#x79CD;&#x811A;&#x672C;&#x8BED;&#x8A00;&#xFF0C;&#x6BD4;&#x5982;Python&#xFF0C;&#x8C03;&#x7528;&#x6B63;&#x5219;&#x8868;&#x8FBE;&#x5F0F;&#x6A21;&#x5757;&#x5904;&#x7406;&#x6587;&#x5B57;&#x8FD8;&#x662F;&#x975E;&#x5E38;&#x65B9;&#x4FBF;&#x7684;&#x3002;</p><p>&#x6700;&#x540E;&#xFF0C;&#x63A8;&#x8350;&#x4E00;&#x4E2A;&#x5B66;&#x4E60;&#x6B63;&#x5219;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x7F51;&#x7AD9;&#xFF1A;<a href="http://www.regexr.com/?ref=localhost">RegExr</a>&#xFF0C;&#x8FD9;&#x4E2A;&#x7F51;&#x7AD9;&#x53EF;&#x4EE5;&#x8BA9;&#x4F60;&#x5B9E;&#x65F6;&#x5730;&#x770B;&#x5230;&#x81EA;&#x5DF1;&#x5199;&#x7684;&#x6B63;&#x5219;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x5339;&#x914D;&#x7ED3;&#x679C;&#x3002;</p>]]></content:encoded></item><item><title><![CDATA[Faster RCNN - 错误汇总]]></title><description><![CDATA[你要知道，我的导师是研究光电技术的，我在实验室搬砖的项目和图像识别相关，当时我选择了Faster RCNN这个开源框架来识别各种纷繁复杂（黑白分明）的OCT图像]]></description><link>https://memolog.us/faster-rcnn-cuo-wu-hui-zong/</link><guid isPermaLink="false">642f84639305f08369ce724e</guid><category><![CDATA[计算机视觉]]></category><dc:creator><![CDATA[Marvin]]></dc:creator><pubDate>Fri, 10 Mar 2017 00:00:00 GMT</pubDate><media:content url="https://images.unsplash.com/photo-1680675805063-3aa8b3607b0a?crop=entropy&amp;cs=tinysrgb&amp;fit=max&amp;fm=jpg&amp;ixid=MnwxMTc3M3wwfDF8YWxsfDk0fHx8fHx8Mnx8MTY4MDgzNTczNQ&amp;ixlib=rb-4.0.3&amp;q=80&amp;w=2000" medium="image"/><content:encoded><![CDATA[<img src="https://images.unsplash.com/photo-1680675805063-3aa8b3607b0a?crop=entropy&amp;cs=tinysrgb&amp;fit=max&amp;fm=jpg&amp;ixid=MnwxMTc3M3wwfDF8YWxsfDk0fHx8fHx8Mnx8MTY4MDgzNTczNQ&amp;ixlib=rb-4.0.3&amp;q=80&amp;w=2000" alt="Faster RCNN - &#x9519;&#x8BEF;&#x6C47;&#x603B;"><p>&#x4F60;&#x8981;&#x77E5;&#x9053;&#xFF0C;&#x6211;&#x7684;&#x5BFC;&#x5E08;&#x662F;&#x7814;&#x7A76;&#x5149;&#x7535;&#x6280;&#x672F;&#x7684;&#xFF0C;&#x6211;&#x5728;&#x5B9E;&#x9A8C;&#x5BA4;&#x642C;&#x7816;&#x7684;&#x9879;&#x76EE;&#x548C;&#x56FE;&#x50CF;&#x8BC6;&#x522B;&#x76F8;&#x5173;&#xFF0C;&#x5F53;&#x65F6;&#x6211;&#x9009;&#x62E9;&#x4E86;Faster RCNN&#x8FD9;&#x4E2A;&#x5F00;&#x6E90;&#x6846;&#x67B6;&#x6765;&#x8BC6;&#x522B;&#x5404;&#x79CD;&#x7EB7;&#x7E41;&#x590D;&#x6742;&#xFF08;&#x9ED1;&#x767D;&#x5206;&#x660E;&#xFF09;&#x7684;OCT&#x56FE;&#x50CF;&#xFF0C;OCT&#x7684;&#x5168;&#x79F0;&#x662F;Optical Coherence Tomography&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x5149;&#x5B66;&#x76F8;&#x5E72;&#x65AD;&#x5C42;&#x6210;&#x50CF;&#xFF0C;&#x5B83;&#x548C;&#x5927;&#x5BB6;&#x719F;&#x6089;&#x7684;CT&#x6210;&#x50CF;&#xFF08;&#x8BA1;&#x7B97;&#x673A;&#x65AD;&#x5C42;&#x626B;&#x63CF;&#xFF09;&#x662F;&#x5C5E;&#x4E8E;&#x4E00;&#x4E2A;&#x8303;&#x7574;&#x7684;&#x6280;&#x672F;&#xFF0C;OCT&#x7684;&#x4E3B;&#x8981;&#x4F18;&#x70B9;&#x5728;&#x4E8E;&#x5BF9;&#x4EBA;&#x4F53;&#x7684;&#x4F24;&#x5BB3;&#x5C0F;&#xFF08;&#x76F8;&#x5BF9;&#x4E8E;CT&#x6210;&#x50CF;&#x800C;&#x8A00;&#xFF09;&#x3002;</p><p>Faster RCNN&#x662F;&#x4E00;&#x4E2A;&#x56FE;&#x50CF;&#x8BC6;&#x522B;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x57FA;&#x4E8E;CNN&#xFF0C;&#x5177;&#x6709;&#x66F4;&#x5FEB;&#x7684;&#x901F;&#x5EA6;&#xFF0C;&#x5B83;&#x4E0D;&#x4EC5;&#x53EF;&#x4EE5;&#x8BC6;&#x522B;&#x51FA;&#x56FE;&#x50CF;&#x4E2D;&#x7684;&#x7269;&#x4F53;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x7528;&#x77E9;&#x5F62;&#x6846;&#x5B9A;&#x4F4D;&#x8BE5;&#x7269;&#x4F53;&#x5E76;&#x7ED9;&#x51FA;&#x7F6E;&#x4FE1;&#x5EA6;&#x3002;&#x521D;&#x671F;&#xFF0C;&#x5B9E;&#x9A8C;&#x5BA4;&#x8001;&#x5E08;&#x7ED9;&#x4E86;&#x6211;&#x5C11;&#x91CF;&#x56FE;&#x50CF;&#x8BA9;&#x6211;&#x8BC6;&#x522B;&#xFF0C;&#x6211;&#x624B;&#x52A8;&#x6807;&#x6CE8;&#x4E86;&#x51E0;&#x767E;&#x5F20;&#xFF0C;&#x8BAD;&#x7EC3;&#x4E4B;&#x540E;&#x6D4B;&#x8BD5;&#x6548;&#x679C;&#x8FD8;&#x4E0D;&#x9519;&#x3002;&#x8FC7;&#x4E86;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#xFF0C;&#x8001;&#x5E08;&#x5F97;&#x5230;&#x4E86;&#x66F4;&#x591A;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x6B64;&#x65F6;&#x624B;&#x52A8;&#x6807;&#x6CE8;&#x663E;&#x7136;&#x662F;&#x4E0D;&#x73B0;&#x5B9E;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x6240;&#x6709;&#x56FE;&#x7247;&#x52A0;&#x8D77;&#x6765;&#x6709;&#x51E0;&#x5343;&#x5F20;&#xFF0C;&#x6211;&#x4E00;&#x5929;&#x6700;&#x591A;&#x80FD;&#x6807;&#x6CE8;&#x51E0;&#x767E;&#x5F20;&#x800C;&#x5DF2;&#xFF0C;&#x800C;&#x4E14;&#x6807;&#x6CE8;&#x4E4B;&#x540E;&#x6211;&#x611F;&#x5230;&#x5F88;&#x60F3;&#x7761;&#x89C9;&#xFF0C;&#x56F0;&#x4E4F;&#x65E0;&#x529B;&#xFF0C;&#x4E8E;&#x662F;&#x6211;&#x5C06;&#x6574;&#x5F20;&#x56FE;&#x7247;&#x5F53;&#x4F5C;&#x5355;&#x4E2A;&#x7269;&#x4F53;&#x7684;&#x533A;&#x57DF;&#xFF0C;&#x5750;&#x6807;&#x7C7B;&#x4F3C;&#x4E8E;<code>(0, 0, length, width)</code>&#x7684;&#x5F62;&#x5F0F;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x56FE;&#x7247;&#x653E;&#x8FDB;&#x53BB;&#x8BAD;&#x7EC3;&#xFF0C;&#x6CA1;&#x60F3;&#x5230;&#x5728;&#x8BAD;&#x7EC3;&#x7684;&#x7B2C;&#x4E00;&#x9636;&#x6BB5;&#x5C31;&#x51FA;&#x73B0;&#x9519;&#x8BEF;&#x4E86;&#x3002;</p><p>&#x9519;&#x8BEF;&#x7684;&#x5177;&#x4F53;&#x4FE1;&#x606F;&#x6211;&#x8BB0;&#x4E0D;&#x5F97;&#x4E86;&#xFF0C;&#x5F53;&#x65F6;&#x4E5F;&#x6CA1;&#x6709;&#x622A;&#x56FE;&#xFF0C;&#x90FD;&#x662F;Python&#x7684;&#x4E00;&#x4E9B;&#x9519;&#x8BEF;&#x63D0;&#x793A;&#xFF08;&#x6CA1;&#x9519;&#xFF0C;&#x6211;&#x7231;Python&#xFF09;&#xFF0C;&#x5927;&#x81F4;&#x5982;&#x4E0B;&#xFF1A;</p><ul><li>&#x6570;&#x503C;&#x8D8A;&#x754C;</li><li>Key Error</li></ul><p>&#x5F53;&#x65F6;&#x8BD5;&#x8FC7;&#x5F88;&#x591A;&#x65B9;&#x6CD5;&#xFF0C;&#x6BD4;&#x5982;&#x4FEE;&#x6539;&#x5B66;&#x4E60;&#x7387;&#xFF0C;&#x91CD;&#x65B0;&#x5236;&#x4F5C;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x7ED3;&#x679C;&#x90FD;&#x65E0;&#x6548;&#xFF0C;&#x4E5F;&#x4E0D;&#x77E5;&#x9053;&#x540E;&#x6765;&#x7075;&#x611F;&#x600E;&#x4E48;&#x5C31;&#x95EA;&#x73B0;&#x51FA;&#x6765;&#x4E86;&#xFF0C;&#x7ADF;&#x53D1;&#x73B0;&#x4E86;&#x95EE;&#x9898;&#x6240;&#x5728;&#xFF0C;&#x89E3;&#x51B3;&#x4E86;&#x8FD9;&#x4E24;&#x4E2A;bug&#x3002;</p><p>&#x6570;&#x503C;&#x8D8A;&#x754C;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x524D;&#x9762;&#x63D0;&#x5230;&#x8FC7;&#x7684;&#xFF0C;&#x6211;&#x5C06;&#x6574;&#x5F20;&#x56FE;&#x7247;&#x4F5C;&#x4E3A;&#x5355;&#x4E2A;&#x7269;&#x4F53;&#x7684;&#x533A;&#x57DF;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x533A;&#x57DF;&#x5750;&#x6807;&#x4E3A;<code>(0, 0, length, width)</code>&#xFF0C;&#x56E0;&#x4E3A;&#x5750;&#x6807;&#x91CC;&#x9762;&#x542B;&#x6709;0&#xFF0C;&#x5BFC;&#x81F4;Faster RCNN&#x5728;&#x8BAD;&#x7EC3;&#x533A;&#x57DF;&#x7684;&#x65F6;&#x5019;&#x51FA;&#x73B0;&#x4E86;&#x8D1F;&#x6570;&#xFF0C;&#x56E0;&#x800C;&#x62A5;&#x9519;&#xFF0C;&#x89E3;&#x51B3;&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x5C06;&#x5DE6;&#x4E0A;&#x89D2;&#x5750;&#x6807;<code>(0, 0)</code>&#x7A0D;&#x5FAE;&#x5411;&#x53F3;&#x4E0B;&#x89D2;&#x504F;&#x79FB;&#x4E00;&#x4E9B;&#xFF0C;&#x6BD4;&#x5982;&#x53D8;&#x6210;<code>(5, 5)</code>&#xFF0C;&#x8FD9;&#x5BF9;&#x8BAD;&#x7EC3;&#x7684;&#x5F71;&#x54CD;&#x4E0D;&#x5927;&#x3002;</p><p>Key Error&#x7684;&#x539F;&#x56E0;&#x662F;&#x6CA1;&#x6709;&#x5220;&#x9664;&#x4E4B;&#x524D;&#x7528;Faster RCNN&#x8BAD;&#x7EC3;&#x6240;&#x4EA7;&#x751F;&#x7684;cache&#xFF0C;&#x5220;&#x9664;&#x5373;&#x53EF;&#x3002;</p>]]></content:encoded></item></channel></rss>